Revit 2027 API
ParameterTypeId.AnalyticalModelSketchProjection Property
 "In-Plane Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelSketchProjection { get; }
Public Shared ReadOnly Property AnalyticalModelSketchProjection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelSketchProjection {
	ForgeTypeId^ get ();
}
static member AnalyticalModelSketchProjection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace